Revit 2027 API
Tile.TileRandomSeed Property
 The property labeled "Randomize" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TileRandomSeed { get; }
Public Shared ReadOnly Property TileRandomSeed As String
	Get
public:
static property String^ TileRandomSeed {
	String^ get ();
}
static member TileRandomSeed : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with a minimum of "0".
See Also
Reference
Tile Class
Autodesk.Revit.DB.Visual Namespace